FKDD_COPY_DIFF_3_2026-02-13/Catalogs/AB_УчетныеЗаписиАльфабанк.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AB_УчетныеЗаписиАльфабанк</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClientID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClientSecret</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>access_token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>refresh_token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>expires_in</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/AB_УчетныеЗаписиАльфабанк/Forms/ФормаАвторизации/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПолучитьТокен(Команда)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ClientSecret",	"");
	СтруктураВозврата.Вставить("access_token",	"");
	СтруктураВозврата.Вставить("refresh_token",	"");
	СтруктураВозврата.Вставить("expires_in",	'00010101');
	
	ПолучитьТокенНаСервере(СтруктураВозврата,ЭтотОбъект.Адрес,ЭтотОбъект.ClientID,ЭтотОбъект.ClientSecret,ЭтотОбъект.refresh_token);
	
	ОповеститьОВыборе(СтруктураВозврата);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ClientID") Тогда
		
		//https://id.alfabank.ru/
		url = "https://id.alfabank.ru/oidc/authorize?response_type=code&client_id="+Параметры.ClientID+"&redirect_uri=http://localhost&scope=openid%20signature%20transactions&state="+ строка(Новый УникальныйИдентификатор);		
		
		ЭтотОбъект.Адрес = url;
		ЭтотОбъект.ClientID = Параметры.ClientID;
		ЭтотОбъект.ClientSecret = Параметры.ClientSecret;
		ЭтотОбъект.refresh_token = Параметры.refresh_token;
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ClientSecret) Тогда
			обработка = Обработки.AB_ОбменАльфаБанк.Создать();
			ЭтотОбъект.ClientSecret = обработка.ПолучитьСекрет(Параметры.ClientID);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьТокенНаСервере(СтруктураВозврата,URL,ClientID,ClientSecret,refresh_token)
	
	КодАвторизации = СтрНайтиПоРегулярномуВыражению(URL,"[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}");
	КодАвторизации = КодАвторизации.Значение;
	
	Обработка = Обработки.AB_ОбменАльфаБанк.Создать();
	СтрТокен = Обработка.ПолучитьТокен(ClientID,ClientSecret,,КодАвторизации);
	
	СтруктураВозврата.ClientSecret 	= ЭтотОбъект.ClientSecret;
	СтруктураВозврата.access_token 	= СтрТокен.Токен;
	СтруктураВозврата.refresh_token = СтрТокен.ТокенОбновления;
	СтруктураВозврата.expires_in 	= СтрТокен.СрокЖизни;
	
КонецПроцедуры


&НаКлиенте
Процедура HTMLДокументСформирован(Элемент)
	Адрес = Элемент.Документ.url;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтотОбъект.HTML = ЭтотОбъект.Адрес;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтраницу(Команда)
	ЭтотОбъект.HTML = ЭтотОбъект.Адрес;
КонецПроцедуры
